Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ཡང་ རི་ དཔག་ཚད་ གསུམ་པ་ ཙམ་ ཅིག་ བླངས་ ནས །_ ལྷ་ པི་ བང་ ཅན་ གསུམ་པ་ དང་ །_ ལྷ་ ཀུན་ དུ་ རྒྱུ་བ་ དག་ ག་ལ་བ་ དེར་ བརྒྱུགས་ ཏེ །_
en: The asura ruler Puṣpamāla will pick up a mountain that measures three leagues and race toward the triple-lute-bearer gods and the wandering gods.

source: ཕན་ཚུན་ གཡུལ་ ཆེན་པོ་ བཀྱེ་བ་ ན་ གཏམ་ དུ་ བརྗོད་ ན་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སྤུ་ ཟིང་ ཞེས་ བྱེད་ ན །_
en: The battle that ensues will become known as that which causes everyone’s hair to stand on end when recounted.

source: གང་ མངོན་དུ་ མཐོང་བ འམ །_ ཐོས་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས །_
en: Needless to mention how hair-raising it would be to actually behold or hear that battle!

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་དགོད་ ཀྱང་ རླུང་ གིས་ ནམ་མཁ འི་ སྤྲིན་ ལྟར་ ལྷ་ རྣམས་ མངོན་པར་ འཇོམས་ ཏེ །_ ཤིན་ཏུ་ བརྩོན་འགྲུས་ དང་ ལྡན་པ་ དེ་ ལ་ ལྷ་ གང་ གིས་ ཀྱང་ ཕྱིར་ བརྒལ་བ ར་ མི་ ནུས་ སོ །_།
en: $341 “The asura ruler Overjoyed will crush the gods like a wind that scatters clouds in the sky, and no god will be able to withstand his extremely powerful attack.

source: དེ་ནས་ དེ་ལྟ ར་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ལ་ མངོན་པར་ འཚེ་བ་ ན་ སུམ་ཅུ་རྩ་གསུམ་ གྱི་ བདག་པོ་ བརྒྱ་བྱིན་ གྱིས་ སུམ་ཅུ་རྩ་གསུམ་པ་ རྣམས་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: When the gods of the Four Great Kings thus suffer devastation, the lord of the Heaven of the Thirty-Three, Śakra, will say to the gods in his realm,

source: ལྷ་མ་ ཡིན་ འབའ་ཞིག་ གིས་ ལྷ་ འདི་དག་ ལ་ མངོན་པར་ འཚེ་ ཞིང་ འདུག་ ན །_ དཔུང་ ཕྱི་ [47b] མ་པ འི་ ལྷ་ དེ་དག་ ཅི་སྟེ་ མི་ རྒྱུག _།
en: ‘Without exception the asuras are bringing harm upon these gods. [47.b] So now the next army of gods must advance.

source: ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ གིས་ ལྷ་ རྣམས་ ཡོངས་སུ་ ཉམས་ ཤིང་ བཅོམ་པ་ དག་ཅི་ ཁྱེད་ ཕམ་པ ར་ དགའ་ འམ །_ གང་ ལྷ འི་ འདུན་ས་ ཆོས་ བཟང་ ན་
en: Would you like to defeat the army of asuras, who are beating and crushing the gods?

source: འཁོད་པ་ དག་མ་ གཏོགས་པ ར་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ རྒྱུགས་ ཤིག _། མ་ལུས་པ ར་ རྒྱུགས་ ཤིག _།
en: Everyone except those posted at the divine assembly hall of Sudarśana must now move forward! Forward, everyone!’

source: དེ་སྐད་ བསྒོ་ ནས་ རབ་དགོད་ དང་ ཐགས་ བཟངས་ རིས་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: $342 “When they receive this command, the gods will then race to confront Overjoyed and Vemacitrin.

source: རབ་དགོད་ ཀྱི་ སྟེང་ དུ་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ མད འི་ ཚོགས་ རྣམས་ དང་ །_ རི་བོ་ ཆར་ ལྟར་ བར་མཚམས་ མེད་པ ས་ ནམ་མཁའ་ བཀང་ ནས་
en: Against Overjoyed the gods of the Heaven of the Thirty-Three will volley incessant swarms of arrows and a downpour of mountains, filling the sky.

source: མངོན་པར་ འབེབས་ ལ །_ རབ་དགོད་ ཀྱང་ རི་བོ་ ཆར་ ལྟར་ མངོན་པར་ འབེབས་ ཤིང་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: In return, Overjoyed will rain down mountains on the gods of the Heaven of the Thirty-Three and storm them.

source: ནམ་མཁའ་ ཐམས་ཅད་ སྒྲ ས་ ཀུན་ དུ་ འགེངས་ ཤིང་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ ཕན་ཚུན་ རྒྱལ་བ་ ལ་ རྟོད་པ་ དེ་དག་ དཔུང་ གི་ ཚོགས་ མ་ལུས་པ་ ཐམས་ཅད་ ཀྱིས་ གཡུལ་འགྱེད་ དོ །_།
en: The whole sky will be filled with cacophony as the gods and asuras seek to defeat each other and the entire extent of their armies clash.

source: དེ་ལྟ ར་ གཡུལ་འགྱེད་པ་ ན །_ གསེར་ གྱི་ རི་བོ་ འབུམ་ སྙེད་ ཕན་ཚུན་ འདྲུད་པ འི་ བུར་ མ་ ལྷུང་བ འི་ རྡུལ་ གྱིས་ ནམ་མཁའ་ ཁེབས་ ཏེ །_ ནམ་མཁའ་ ཀུན་ ནས་ བར་མཚམས་ མེད་པར་ དཔག་ཚད་ སྟོང་ ཙམ་ གསེར་ གྱི་ རྡུལ་ གྱིས་ ཁེབས་ སོ །_།
en: As they lift up hundreds of thousands of golden mountains and fling them at each other, the sky fills with dust, so that soon the sky becomes completely filled with gold dust for up to a thousand leagues.

source: རྡུལ་ གྱི་ བར་ དེ་དག་ ན་ ཡང་ ཇི་ལྟ ར་ ཆར་ གྱི་ རྒྱུན་ རྒྱུན་ མི་འཆད་པ ར་ འབབ་པ་ ལྟར་ རྣམ་པ་ དེ་ལྟ་ བུ འི་ མད འི་ ཚོགས་ ཕན་ཚུན་ ཆར་ ལྟར་ འབེབས་ སོ །_། དེ་བཞིན་ དུ་ ཕན་ཚུན་ རི་བོ་ ཆར་ ལྟར་ མངོན་པར་ འབེབས་ ཤིང་ ལྷ་མ་ ཡིན་ བྱེ་བ་ དུ་མ་ དེ་དག་ འཇོམས་པ ར་ བྱེད་པ འི་ གཡུལ་ བཀྱེའོ །_།
en: Swarms of arrows from the two sides fall like a constant rain between the dust particles, and the warring parties likewise release a downpour of mountains upon each other.

source: ལྷ་ སྟོང་ཕྲག་ དུ་མ་ རྣམས་ ཀྱང་ གཞོམ་པ ར་ བྱ་བ འི་ ཕྱིར་ གཡུལ་ ཤིན་ཏུ་ མི་བཟད་པ་ བཀྱེའོ །_།
en: As the battle rages, many millions of asuras are destroyed, but many thousands of gods are likewise crushed in the terrible battle.

source: བཀྱེ་ ནས་ ལྷ་མ་ ཡིན་ སྙིང་སྟོབས་ ཆུང་བ་ ཕམ་པ ར་ གྱུར་པ་ ཤི ར་ དོགས་པ་ གང་ཡིན་པ་ དེ་དག་ ས འི་ འོག་ ཏུ་ ཞུགས་ སོ །_།
en: $343 “As the battle progresses, those asuras with lesser courage will retreat below the earth, defeated and fearing for their lives.

source: མ་ལུས་པ ར་ བཅོམ་པ་ ཞུགས་པ་ དེ་དག་ ལ་ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ དག་ གིས་ སྨྲས་པ །_ ཀྱེ་མ་ ལྷག་མ ར་ གྱུར་པ་ བདག་ཅག་ གི་ ཁྱིམ་ཐབ་ དེ་དག་ ག་རེ །_
en: Seeing those losers, the asura women will ask, ‘Oh, where are those of our husbands that were left behind?’

source: དེ་སྐད་ འདྲི་བ་ དེ་དག་ ལ་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ སྨྲས་པ །_ དེ་དག་ ནི་ འདི་ལྟར་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ལས་ རྒྱལ་བ་ ཐོབ་ སྟེ འདིར་ འོང་ ངོ་ །_།
en: $344 “The asuras will reply, ‘They have triumphed in the battle between the gods and asuras and are on their way.’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ དག་ མཚོ་ ཀུན་མཐོང་བ་ ག་ལ་ བ་ དེར་ དོང་བ་ དང་ །_ དེ་དག་ ཐམས་ཅད་ མཐོང་ [48a] སྟེ །_ ཇི་ལྟ ར་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ བཏགས་ ཤིང་ བཅོམ་ སྟེ །_
en: The asura women will then go to Mirror Lake, [48.a] but, as they behold its surface, they will see how the asuras have been defeated and destroyed by the gods.

source: དེ་ལྟ ར་ ལན་ བརྒྱ འམ་ སྟོང་ དུ་ ཕམ་པ ར་ བྱས་པ་ དེ་དག་ དེ་བཞིན་ མཐོང་ ནས །_ ཁྱིམ་ཐབ་ བསད་པ འི་ ཕྱིར་ ཉོན་མོངས་ ཤིན་ཏུ་ ཡི་ ཆད་ དེ་ ས འི་ སྟེང་ དུ་ འདུག་ ནས་ ངུ་བ ར་ བྱེད །_ སྨྲེ་སྔགས་ འདོན །_ རབ་ཏུ་ སྡུག་བསྔལ་བ་ ཀུན་ མཚོ་ དེ་ ཡོངས་སུ་ བསྐོར་ ནས་ འཁོད་ ལ་ བྲང་ རྡུང་བ ར་ བྱེད །_
en: When they see the myriad ways in which the asuras suffered defeat, they will realize that their husbands have been killed. Overwrought by pain and despair, they will stand crying and wailing on the banks of the lake.

source: སྐྲ་ འབལ་བ ར་ བྱེད །_ ལུས་ ལ་ འབྲད་པ ར་ བྱེད །_ མཆི་མ ས་ གདོང་གཤེར་ བར་ བྱེད་ དོ །_། དེ་ལྟ ར་ མཚོ འི་ ནང་ ན་ ཁྱིམ་ཐབ་ དག་ ཕམ་ སྟེ །_ བསད་པ ར་ མཐོང་ ནས །_ སྨྲེ་སྔགས་ འདོན་ ཏོ །_།
en: In this way, Mirror Lake will become encircled by suffering asura women beating their chests, tearing out their hair, and scratching their bodies, with their faces covered in tears. As the women thus witness the defeat and killing of their husbands, they will cry out in anguish.

source: དེ་ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ཤིན་ཏུ་ མི་བཟད་པ ར་ འཇུག་པ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་དགོད་ ལྷ་མ་ ཡིན་ བྱེ་བ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ནས །_ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ འགྲོ་བ ར་ བྱེད་ དོ །_།
en: $345 “While the gods and asuras are engaged in their terrible battle, the asura ruler Overjoyed, surrounded by millions of asuras, will move on Śakra, ruler of the gods.

source: དེ་དག་ ཉིད་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ ལྷ་ རྣམས་ ལ་ བསྒོ་བ །_
en: When Śakra sees that, he will tell the gods,

source: འདི་ལྟར་ ལྷ་མ་ ཡིན་ འདི་དག་ ནི་ གཡུལ་འགྱེད་ དུ་ བདག་ཅག་ ག་ལ་བ་ དེར་ འོང་ སྟེ །_ དཔུང་ ཆུང་ངུ་ གདུལ་བ ར་ དཀའ་བ་ དེ་དག་ ནི་ ཇི་ལྟ ར་ འོད་ ཀྱིས་ མུན་པ་ བསལ་བ་ དེ་ལྟ ར་ གྲོགས་ ཆོས་ ཀྱིས་ རྒྱལ་བ ར་ བྱ འོ །_།
en: ‘The asuras are coming to attack us. Their trifling army may be hard to control, but, friends, just like light disperses darkness, we shall defeat them with the Dharma.’

source: དེས་ ལྷ་ རྣམས་ ལ་ དེ་སྐད་ བསྒོ་ ནས །_ གླང་པོ་ཆེ འི་ རྒྱལ་པོ་ ས་སྲུང་ གི་ བུ་ ལ་ ཞོན་ ཏེ །_ ལྕགས་ ཀྱི་ མདའ་ འཕངས་པ་ བཞིན་ དུ་ རབ་དགོད་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: $346 “When he has given this instruction to the gods, he will proceed to ride forth on his elephant, Airāvaṇa, while shooting iron arrows at Overjoyed.

source: དེ་ རྒྱུག་པ་ ན་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ འདུན་ས་ ཆོས་ བཟང་ ན་ གནས་པ འི་ ལྷ་ རྣམས་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ནས །_ རྡོ་ དང་ ཤིང་ གིས་ འགྱེད་པ་ དག་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: As Śakra advances, the gods inhabiting the divine assembly hall of Sudarśana will surround him and charge forward while throwing rocks and trees.

source: ཁ་ཅིག་ ནི་ མདའ་ ཆར་ ལྟར་ མངོན་པར་ འབེབས་ ཤིང་ རབ་དགོད་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Some of them will also fire off a rain of arrows as they march on Overjoyed.

source: རབ་དགོད་ ཀྱང་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ ཤིང་རྟ་ སྒྱུར་བ ར་ བྱེད་ ཅིང་ འདི་ལྟར་ བརྒྱ་བྱིན་ པས་ བདག་ རྒྱལ་བ ར་ བྱ འོ་ ཞེས་ ཟེར་ རོ །_།
en: $347 “Overjoyed will then drive his chariot against Śakra, shouting, ‘Against Śakra I shall prevail!’

source: དེ་ནས་ བརྒྱ་བྱིན་ གྱིས་ རབ་དགོད་ དེ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: “At this point Śakra will tell Overjoyed,

source: ཆོས་མ་ ཡིན་པ འི་ ལམ་ ལ་ གནས་པ འི་ དུད་འགྲོ་ ད་ག ར་ འགྲོ །_། འདི་ལྟར་ ང་ ནི་ ཁྱོད་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ འོངས་ ཏེ །_ འདི་ལྟར་ ངས་ ཁྱོད་ རྒྱགས་པ་ དང་ ཕྲལ་ ནས །_ དེ་ནས་ ཡང་ ས འི་ འོག་ ཏུ་ གཏང་བ ར་ བྱ འོ །_།
en: ‘You animal wandering the path of non-Dharma, where are you going now? I have come here to vanquish you. I shall relieve you of your arrogance and send you back, below the ground.’ [48.b]

source: དེ་ནས་ ཐགས་ བཟངས་ རིས་ དང་ །_ [48b] རབ་དགོད་ ཀྱིས་ བརྒྱ་བྱིན་ ལ་ སྨྲས་པ །_
en: $348 “Overjoyed and Vemacitrin will jointly reply,

source: འདི་ལྟར་ ང་ ཡང་ བརྒྱ་བྱིན་ ཁྱོད་ དང་ ལྷ་ ཐམས་ཅད་ ཆད་པ ས་ གཅད་པ ར་ བྱ་བ འི་ ཕྱིར་ འོངས་པ་ ཡིན་ ནོ །_།
en: ‘Śakra, we are here to chastise you and all the gods.’

source: དེ་ནས་ ཐགས་ བཟངས་ རིས་ དང་ རབ་དགོད་ ཀྱིས་ གསེར་ གྱི་ རི་ དཔག་ཚད་ ལྔ་པ་ གཅིག་ འཕངས་ སོ །_། འཕངས་པ་ དེ་ མངོན་པར་ མཐོང་ ནས་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ འི་ ཁ་ ནས་ དབུགས་ཕྱུང་ བས་ རི་ དེ་ བྱེ་མ་ ཆང་པ་ ནས་ གཏོར་བ་ བཞིན་ ཕྱིར་བཟློག་ ནས་ རྒྱ་མཚོ ར་ ལྷུང་ ངོ་ །_།
en: With this, they will hurl a gold mountain measuring five leagues at Śakra, but when his elephant Airāvaṇa sees that, he will exhale so forcefully that the mountain is pulverized and dissolves into the sea as though it were a handful of sand.

source: རི་ ཕྱེ་མར་ བརླགས་ ཤིང་ གཏོར་བ་ དེ་ མངོན་པར་ མཐོང་ ནས །_ དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ དག་ གིས་ རི་བོ་ རྡོ་རྗེ འི་ ལྟེ་བ་ ཅན་ དཔག་ཚད་ ལྔ་པ་ གཅིག་ བླངས་ ནས་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ འཕངས་ སོ །_།
en: $349 “When they see how the mountain is reduced to dust and dispersed, the asuras will proceed to pick up a mountain that also measures five leagues but has a vajra core, and hurl it at Śakra.

source: འཕངས་པ་ དེ་ མངོན་པར་ མཐོང་ ནས་ ས་སྲུང་ གི་ བུ འི་ སྣ འི་ ཐོར་ཏོ ས་ བཟུང་ སྟེ །_ སླར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ལ་ འཕངས་ ཏེ །_
en: However, when Airāvaṇa sees that, he will catch the mountain in his trunk and hurl it back at the asura rulers.

source: གླང་པོ་ཆེ་ འདི་ ནི་ ཅང་ཤེས་པ་ ཡིན་ ནོ །_།
en: Indeed, that elephant is a thoroughbred.

source: རང་ གི་ རི་ འཕངས་པ་ དེས་ དེ འི་ བྲང་ དུ་ བརྒྱབ་པ་ དང་ །_ རབ་དགོད་ དེ་ བརྒྱབ་པ་ དེས་ ཉམས་ ནས་ སྟན་ དེ་ལས་ ལྷུང་ ཞིང་ །_ སླར་ འཁོད་ དེ་ བརྒྱབ་པ་ དེས་ རབ་ཏུ་ ཉམས་ སོ །_།
en: When the mountain that Overjoyed threw in that way is thrown back at him, he will be hurt and fall from his seat. As he tries to stand up, however, he will be struck once again, and thus become devastated.

source: དེ་ མཐོང་ ནས་ སུམ་ཅུ་རྩ་གསུམ་པ་ དག་ སྒྲ་ ཆེན་པོ ས་ ནམ་མཁའ་ བཀང་ ནས །_
en: $350 “As the gods of the Heaven of the Thirty-Three see this, they fill the sky with their exclamations:

source: འདི་ལྟར་ ལྷ འི་ དབང་པོ ས་ དུད་འགྲོ་ དེ་ ཕམ་པ ར་ བྱས་ ཏེ །_
en: ‘The ruler of the gods has defeated that animal!

source: འདིར་ རེ་ཞིག་ གླང་པོ་ཆེ འི་ མཆོག་ འདི ས་ འཕངས་པ འི་ ཤུགས་ ཀྱིས་ མངོན་པར་ ཉམས་ ཤིང་ གཡོས་ ན་ གལ་ཏེ་ རྡོ་རྗེ ས་ བརྒྱབ་པ ར་ གྱུར་ ན་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས །_
en: If a blow caused merely by Lord Śakra’s perfect elephant can make Overjoyed fall and roll over, then just imagine what a strike by his vajra would do!’

source: དེ་སྐད་ སྨྲས་ ནས །_ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ བརྒྱུགས་ ཏེ །_
en: $351 “The gods of the Heaven of the Thirty-Three will then surge toward the asuras.

source: ལ་ལ་ ནི་ རྡོ་ དང་ ཤིང་ གིས་ འགྱེད །_ ལ་ལ་ ནི་ རི་བོ ས་ འགྱེད །_ ལ་ལ་ ནི་ རྩེ་ གསུམ་ ཁ་ གདེང་ གིས་ འགྱེད །_ ལ་ལ་ ནི་ སྟེའུ་ ཁ ས་ འགྱེད །_ ལ་ལ་ ནི་ གློག་ འབྱུང་བ ས་ འགྱེད །_ ལ་ལ་ ནི་ ཐོང་གཤོལ་ གྱིས་ འགྱེད །_ ལ་ལ་ ནི་ སྟོབས་ ཀྱིས་ འགྱེད །_ ལ་ལ་ ནི་ འཁོར་ལོ ས་ འགྱེད །_ ལ་ལ་ ནི་ རལ་གྲི ས་ འགྱེད །_ ལ་ལ་ ནི་ ནམ་མཁའ་ ལ་ འགྲོ་བ ས་ འགྱེད །_ ལ་ལ་ ནི་ སྣ་ཚོགས་ པས་ འགྱེད །_ ལ་ལ་ ནི་ ཐོ་བ ས་ འགྱེད །_ ལ་ལ་ ནི་ མཚོན་ཆ་ མཆོག་ ཏུ་ གདམས་པ ས་ འགྱེད །_ ལ་ལ་ ནི་ མཚོན་ཆ་ དྲི་མ་ མེད་པ ས་ འགྱེད །_ ལ་ལ་ ནི་ མཚོན་ཆ་ རབ་བྱེད་ ཀྱིས་ འགྱེད །_ ལ་ལ་ ནི་ མཚོན་ཆ་ བྱི་བདར་ བྱེད་ ཀྱིས་ འགྱེད །_ ལ་ལ་ ནི་ མཚོན་ཆ་ བརྩེགས་པ ས་ འགྱེད །_ ལ་ལ་ ནི་ མེས་ འགྱེད །_ [49a] ལ་ལ་ ནི་ ཆུས་ འགྱེད །_ ལ་ལ་ ནི་ ཆུ་འབེབས་ པས་ འགྱེད །_ ལ་ལ་ ནི་ ཐམས་ཅད་ ཀྱིས་ འགྱེད །_ ལ་ལ་ ནི་ མཚོན་ཆ་ ནག་པོ ས་ འགྱེད །_ ལ་ལ་ ནི་ སྒྱུ་མ ས་ འགྱེད །_ ལ་ལ་ ནི་ འདུད་པ ས་ འགྱེད །_ ལ་ལ་ ནི་ སེན་མོ ས་ འགྱེད །_ ལ་ལ་ ནི་སྒྲ ས་ འགྱེད་ དེ །_ སྒྲ འི་ ཤུགས་ གང་ མཉན་པ ར་ ཡང་ མི་ ནུས་ སོ །_། ལ་ལ་ ནི་ རྡོག་པ་ རྡེག་པ ས་ འགྱེད་ དེ །_
en: Some will fight with rocks and trees, some with mountains, some with tridents, some with axes, some with lightning, some with plowshares, some with their powers, some with disks, some with swords, some by flying, some with various maneuvers, some with hammers, some with sophisticated weapons, some with stainless weapons, some with common weapons, some with scything weapons, some with blades, some with fire, [49.a] some with water, some with streams of water, some with combinations of sundry weapons, some with black weapons, some with magic, some with noise, some with nails, some with clamor, some with unbearably loud noises, and some by kicking.

source: རྣམ་པ་ དེ་ལྟ་ བུ འི་ གོ་མཚོན་ སྣ་ཚོགས་ ཀྱིས་ ལུས་ ཤིན་ཏུ་ བསྲུངས་པ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ བརྒྱ་བྱིན་ ལྷ་ ཐམས་ཅད་ ཀྱི་ མདུན་ དུ་ བཞག་ གོ །_།
en: Fighting in these ways, and with their bodies well protected by various types of armor, all the gods headed by Śakra shall set out to conquer the asuras.

source: དེ་ནས་ མོག་མོག་པོ ར་ གྱུར་པ་ དེ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཐགས་ བཟངས་ རིས་ ལ་སོགས་པ་ ལག་ ན་ མཚོན་ཆ་ སྣ་ཚོགས་པ་ རྣམས་ རབ་དགོད་ ཀྱི་ དཔུང་ བྱ་བ་ དང་ །_ བརྒྱ་བྱིན་ གཏག་པ འི་ ཕྱིར་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: $352 “Seeing that Overjoyed has become pale, Vemacitrin and the other asura rulers will come to support him. Brandishing various weapons, they will approach Śakra to destroy#250 him.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བཞི་པོ་ དག་ བརྒྱ་བྱིན་ ཁོ་ན་ ལ་ འགྱེད་ དུ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་ རྣམས་ བརྒྱ་བྱིན་ གྱི་ དཔུང་ གི་ རིམ་གྲོ་ བྱ་བ་ དང་ །_ རང་ གི་ རྩལ་ སྟོན་ ཅིང་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: Noticing that all four of the asura rulers are coming to attack Śakra, the gods will in turn come forth to offer their military assistance to Śakra and to display their own prowess.

source: དེ་ནས་ བརྒྱ་བྱིན་ གྱིས་ འོང་བ་ དེ་དག་ མངོན་པར་ མཐོང་ ནས་ ཤིན་ཏུ་ ཁྲོས་ ཏེ་ ཆས་ ནས་ སྨྲས་པ་
en: $353 “When Śakra sees the approaching asuras, he will become furious and shout,

source: དུད་འགྲོ་ ཁྱེད་ ཅི་སྟེ་ ཤིན་ཏུ་ རྨོངས །_
en: ‘Animals, why are you so stupid?

source: གང་ ཁྱེད་ ཀྱི་ དཔུང་ རྣམ་པ་ འདི་ ལྟ་བུ་ ནི་ རེ་ཞིག་ ལྷ་མ་ ཡིན་ ཐམས་ཅད་ ལ་ བདོག་ པར་ གྱུར་ ཀྱང་ དེ་དག་ ང་ འབའ་ཞིག་ གིས་ ཕམ་པ ར་ བྱ་བ ར་ ནུས་ སོ །_།
en: Even if all the asuras were to join your army, I alone could defeat it.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_ འདི་དག་ གི་ དཔུང་ ནི་ ཆོས་ ཡིན་ ཏེ །_
en: Why? Because our army is righteous.

source: ལྷ་ རྣམས་ ཀྱི་ དཔུང་ ནི་ ཆོས་ ཡིན་ ནོ །_།
en: The army of the gods is righteous.

source: ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ དཔུང་ ནི་ ཆོས་མ་ ཡིན་ ནོ །_།
en: The army of the asuras is unrighteous.

source: ཆོས་ དང་ ཆོས་མ་ ཡིན་པ འི་ ཁྱད་པར་ ནི་ ཆེ་ སྟེ །_
en: The difference between Dharma and non-Dharma is tremendous.

source: གང་ ཁྱད་པར་ ནི་ མུན་པ་ དང་ ཉི་མ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ བདེན་པ་ དང་ བརྫུན་པ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ རི་རབ་ དང་ ཡུངས་འབྲུ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ ཐར་པ་ དང་ བཅིངས་པ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ བཟ ར་ རུང་བ་ དང་ བཟ ར་ མི་ རུང་བ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ བདུད་རྩི་ དང་ དུག་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ མཚན་མོ་ དང་ ཉིན་པ ར་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ ནོར་བུ་ མཆིང་བུ་ དང་ །_ རིན་པོ་ཆེ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ [49b] ནི་ དབུལ་བ་ དང་ ཕྱུག་པ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ བྱ་བ་ དང་ མི་ བྱ་བ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ ཉི་མ་ དང་ སྲིན་བུ་ མེ་ཁྱེར་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ ཁྲོ་བ་ ལ་ རླུང་ དང་ སྲིན་བུ་ མང་ ཀུ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ མཐོང་བ་ དང་ །_ མི་ མཐོང་བ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ ཡང་དག་པ འི་ ལམ་ དང་ །_ ཡང་དག་པ་ མ་ཡིན་པ འི་ ལམ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ སངས་རྒྱས་ དང་ གཞན་ མུ་སྟེགས་པ་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ གནམ་ དང་ ས་ ལྟར་ ཆེ འོ །_། གང་ ཁྱད་པར་ ནི་ བསྐལ་པ་ དང་ སྐད་ཅིག་མ་ ལྟར་ ཆེ་ སྟེ །_
en: They are as different as darkness and sunshine, truth and lies, Mount Sumeru and a sesame seed, liberation and bondage, the edible and the inedible, ambrosia and poison, night and day, trinkets and jewels, [49.b] poverty and wealth, right and wrong, the sun and a firefly, a great storm and a mosquito,#251 the seen and the unseen, the true path and the false path, buddhas and non-Buddhists, heaven and earth, an eon and an instant.

source: ང་ དང་ ཁྱེད་ ནི་ ཁྱད་པར་ དེ་ལྟ ར་ ཆེ འོ །_།
en: You and I are that different!

source: ཁྱེད་ ནི་ ཆོས་མ་ ཡིན་པ་ ལ་ གཙོ་བོ ར་ བྱེད་ ལ །_ ངེད་ ནི་ ཆོས་ གཙོ་བོ ར་ བྱེད་ དོ །_།
en: You take unrighteousness to be the most important thing while I hold righteousness to be the most important.

source: ཁྱོད་ ནི་ ཤེས་རབ་ དམན་པ་ ཡིན་ ལ །_ ལྷ་ རྣམས་ ནི་ ཤེས་རབ་ དང་ བཅས་པ་ ཡིན་ ནོ །_།
en: Your intelligence is inferior, whereas the gods are intelligent.

source: ཁྱེད་ ནི་ བརྩོན་པ་ མེད་པ་ ཡིན་ ལ །_ ལྷ་ རྣམས་ ནི་ བརྩོན་པ་ དང་ བཅས་པ་ ཡིན་ ནོ །_།
en: You have no vigor, whereas the gods do.

source: ཁྱེད་ ནི་ དུད་འགྲོ་ ཡིན་ ལ་ ལྷ་ རྣམས་ ནི་ ལྷ་ ཡིན་ ཏེ །_
en: You are animals, whereas the gods are gods.

source: ལྷ་ དེ་དག་ ནི་ དེ་ལྟ་ བུ་ ཡིན་པ ར་ ཁོང་ དུ་ ཆུད་ ནས་ ཁྱེད་ ངེད་ ཀྱི་ དྲུང་ དུ་ མངོན་པར་ རྒྱུག་པ་ ནི་ མི་རིགས་ སོ །_།
en: Once you comprehend this, you will understand that it makes no sense to run up against me.’

source: དེ་སྐད་ སྨྲས་ ནས །_ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ཁ་ལོ་ བསྒྱུར་ ཏེ །_ འདི་ལྟར་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ ཀྱང་ སྨྲས་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: $354 “Having made such statements, Śakra will steer Airāvaṇa toward the asuras. Thus directing Airāvaṇa toward the asuras, he will say:

source: ཆོས་ ཀྱིས་ ཆོས་ མིན་ ཕམ་པ ར་ བྱས །_ བདེན་པ ས་ བརྫུན་པ་ ཕམ་པ ར་ བྱས །_། ཤེས་པ ས་ གཏི་མུག་ ཕམ་པ ར་ བྱས །_། ལྷ་ ཡིས་ ལྷ་མིན་ ཕམ་པ ར་ བྱས །_།
en: “ ‘Dharma defeats non-Dharma, Truth defeats falsity, Knowledge defeats ignorance, And gods defeat asuras.’

source: དེས་ དེ་སྐད་ སྨྲས་ ནས །_ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ཁ་ལོ་ བསྒྱུར་ ཏེ །_ སྤྲུལ་པ་ ཡང་ སྔ་མ་ བཞིན་ བྱས་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བཞི་པོ་ དེ་དག་ ཐམས་ཅད་ ག་ལ་བ་ དེར་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ རྡོ་རྗེ་ རྩེ་མོ་ སྟོང་ ཡོད་པ་ ནི་ ཐོགས །_
en: $355 “While creating the same kinds of emanations as before, Śakra, leader of the gods, will gallop toward the four asura leaders, brandishing his thousand-pointed vajra.

source: བསྡིགས་པ འི་ མཚན་མ་ ཙམ་ སེམས་ ཀྱིས་ གསད་ ཅིང་ བཅིང་བ ར་ ལྷག་པ ར་ མོས་པ འི་ སེམས་ ནི་ མེད་པ ས །_ རླུང་ གི་ ཤུགས་ པས་ ཆེས་ མགྱོགས་པ ར་ རབ་ཏུ་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Without any evil thoughts and having no intent to kill or capture anyone, he will rush ahead with a speed that is greater than the wind.

source: ལྷ་མ་ ཡིན་ དེ་དག་ མངོན་པར་ རྒྱུག་པ་ དང་ །_ དེ་དག་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_ རྒྱལ་ཆེན་ བཞི་ དང་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ཀྱང་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: $356 “When they see Śakra storming ahead while the attacking asuras come up against him, the gods of the Four Great Kings and the Heaven of the Thirty-Three will also charge forward.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ ཕན་ཚུན་ རྣམ་པར་ འཇོམས་པ་ ན་སོ་ [50a] སོར་ རྒྱལ་བ ར་ འདོད་པ །_ གཅིག་ ལ་ གཅིག་ མངོན་པར་ འདེབས་པ །_ མོག་མོག་པོ ར་ གྱུར་པ །_ ལྷ་མ་ ཡིན་ ཁ་ཅིག་ ནི་ སྲོག་ དང་ བྲལ་བ ར་ གྱུར །_
en: Thus, when the gods and asuras clash and combat each other [50.a] in pursuit of victory, they will strike each other and become pale, and some asuras will die.

source: དེ་བཞིན་ དུ་ ལྷ་མ་ ཡིན་ ཁ་ཅིག་ ནི་ སྡུག་བསྔལ་ གྱིས་ ཉམ་ཐག་ སྟེ །_ ཕྱིར་ལོག _།
en: Some asuras will be distraught by suffering and retreat.

source: ཁ་ཅིག་ ནི་ ཡི་ ཆད་ ནས་ ཕྱིར་ལོག _།
en: Some will lose all courage and retreat.

source: ཁ་ཅིག་ ནི་ མིག་ ཚུགས་ སུ་ ལྟ་ ཞིང་ འཁོད །_
en: Some will just stand there, staring blankly ahead.

source: ཁ་ཅིག་ ནི་ རང་ གི་ གནས་ སུ་ འགྲོ་བ ར་ སེམས་ ཤིང་ འཁོད །_
en: Some will linger, though they long to return home.

source: ཁ་ཅིག་ ནི་ ཞེ་སྡང་ གིས་ ཉམ་ཐག _།
en: Some will become overcome by anger.

source: ཁ་ཅིག་ ནི་ གཏི་མུག་ གིས་ སེམས་ བསྒྲིབས །_ ཁ་ཅིག་ ནི་ ཡོངས་སུ་ ཉམས་ ཤིང་ ཡིད་ དམན་པ ར་ གནས་ ཏེ་
en: Some will be dazed and stupefied.

source: དེ་ནས་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ཁ་ རེ་རེ་ ལ་ པད་མ་ རེ་རེ །_ པད་མ་ རེ་རེ་ ལ་ དབང་པོ་ ལག་ ན་ རྡོ་རྗེ་ ཐོགས་པ་ མཚོན་ཆ་ དང་ གོ་མཚོན་ བགོས་པ་ རྣམས་ སྔར་ བསྟན་པ་ བཞིན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ ས་ མཐོང་ སྟེ
en: Then, to all who linger, Śakra, riding upon Airāvaṇa, will display his emanations. $357 “As he does so, the rulers of the asuras will behold a lotus flower upon each of Airāvaṇa’s heads. Upon each of the lotuses stands a separate Śakra, who brandishes a vajra and is equipped with arms and weaponry as described before.

source: དེ་དག་ ཀྱང་ དབང་པོ འི་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ཁ་སྟོང་ ཡོད་པ །_ ཁ་ རེ་རེ་ ལ་ པད་མ འི་ རྫིང་བུ་ སྟོང་ ཡོད་ དོ །_། པད་མ འི་ རྫིང་ རེ་རེ་ ལ་ པད་མ་ སྟོང་ ཡོད་ དོ །_། པད་མ་ རེ་རེ་ ལ་ འདབ་མ་ སྟོང་ ཡོད་ དོ །_།
en: Moreover, upon each of the thousand heads of Airāvaṇa, the elephant of the lord of the gods, they will behold a thousand lotus pools, and in each pool will lie a thousand lotuses.

source: པད་མ་ རེ་རེ་ ལ་ སྙིང་པོ་ བརྒྱ་ ཡོད་ དོ །_། དེ་དག་ ཀྱང་ ས་སྲུང་ གི་ བུ འི་ ཁ་ ནས་ བྱུང་ སྟེ །_ འདབ་མ་ དེ་དག་ དང་ སྙིང་པོ་ དེ་དག་ ཐམས་ཅད་ ལ་ དབང་པོ་ རྟག་ ཏུ་ ལག་ ན་ རྡོ་རྗེ་ དང་ །_ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ ཐོགས་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ དུ་མ་ འཁོད་པ ར་ མཐོང་ ངོ་ །_།
en: Each of the lotuses has a thousand petals and a hundred stamens, and upon each lotus and each stamen stand trillions of Śakras, brandishing vajras, weapons, and arms.

source: དེ་ནས་ སྤྲུལ་པ་ དེ་ལྟ་ བུ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ རྣམས་ སྐྲག་ འཁྲུགས་ ཏེ །_ དབང་པོ་ གོ་མཚོན་ དང་ ཆ་བྱད་ སྣ་ཚོགས་ ཐོགས་པ་ རྣམས་ ཀྱིས་ དེ་ རྟག་ ཏུ་ གང་ ཞིང་ དཔུང་ དང་ མཐུ་ དཔེ་མེད་པ་ རྣམས་ ཀྱིས་ ནམ་མཁའ་ འདི་ བར་མཚམས་ མེད་པར་ བྱས་ སོ །_།
en: $358 “The sight of these emanations terrifies the asuras, because all these Śakras, brandishing numerous forms of weaponry and taking a variety of forms, will fill the sky in its entirety, displaying unimaginable power and might. Horrified, the asuras will gasp at one another,

source: མཚོན་ཆ འི་ ཚོགས་ ཀྱིས་ ཕྱོགས་ དང་ ཕྱོགས་མཚམས་ ཐམས་ཅད་ བར་མཚམས་ མེད་པར་ གང་བ ར་ བྱས་ སོ །_།
en: ‘This multitude of weapons extends throughout all directions without any gaps between them.

source: དབང་པོ་ རྣམས་ ཀྱིས་ ས འི་ འོག་ གང་ཡིན་པ་ དེ་ དང་ །_ དེ་ཡང་ བར་མཚམས་ མེད་པར་ བྱས་པ ར་ དོགས་ སོ་ ཞེས་ དེ་སྐད་ ལྷ་མ་ ཡིན་ ཤིན་ཏུ་ སྐྲག་པ་ དེ་ རྣམས་ ཕན་ཚུན་ སྨྲ འོ །_།
en: I fear that these Śakras have also infiltrated the ground beneath us in the same way!’

source: དེ་སྐད་ སྨྲ་བ་ དེ་ རྣམས་ ལ་ རབ་དགོད་ ཀྱིས་ སྨྲ་བ །_ ལྷ་ [50b] མ་ ཡིན་ དག་ ངས་ དབང་པོ་ ས་སྲུང་ གི་ བུ་ དང་ བཅས་ ཏེ་ ཕྱིར་བཟློག་ པར་ བྱས །_
en: $359 “To those who speak in this way, Overjoyed will reply, [50.b] ‘Asuras, I shall repel Śakra and his Airāvaṇa!

source: མ་ འཇིགས་ ཤིག་ མ་ འཇིགས་ ཤིག _།
en: Fear not, fear not!’

source: དེ་སྐད་ སྨྲས་ ནས་ གླང་པོ་ཆེ འི་ རྒྱལ་པོ་ ས་སྲུང་ གི་ བུ་ག་ ལ་བ་ དེར་ བརྒྱུགས་ སོ །།_།།
en: With these words Overjoyed will charge Airāvaṇa, the king of elephants.

source: དེ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_ ས་སྲུང་ གི་ བུ འི་ སྣ འི་ ཐོར་ཏོ ས་ བཟུང་ སྟེ །_ ནམ་མཁའ་ ལ་ གསོབ་ བཞིན་ སྐོར་བ ར་ བྱེད་ དོ །_།
en: When Airāvaṇa sees him coming, the elephant will snatch Overjoyed up with the tip of his trunk and twirl him around as if he were light as air.

source: དེ་ བསྐོར་བ་ ན་ སྲོག་ གི་ ལྷག་མ་ ཆུང་ ཟད་ ཅིག་ ལུས་ ནས་ བཏང་ ངོ་ །_།
en: Having swung him around like that, he will finally let go of him when only a trace of life is left in him.
